Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkSymbol Constructor
 Creates a new section mark symbol instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkSymbol()
Public Sub New
See Also
Reference
SectionMarkBase.SectionMarkSymbol Class
SectionMarkBase.SectionMarkSymbol Overload
Tekla.Structures.Drawing Namespace